cmsis-svd/cmsis-svd/data/SiliconLabs/MGM13S02F512GN.svd
        <register>
          <name>SINGLECTRL</name>
          <description>Single Conversion Control</description>
          <addressOffset>0x03C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007F0</resetMask>
          <fields>
            <field>
              <name>SINGLESEL</name>
              <description>Single Channel Input Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>APORT1XCH0</name>
                  <value>0x00000020</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH1</name>
                  <value>0x00000021</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH2</name>
                  <value>0x00000022</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH3</name>
                  <value>0x00000023</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH4</name>
                  <value>0x00000024</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH5</name>
                  <value>0x00000025</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH6</name>
                  <value>0x00000026</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH7</name>
                  <value>0x00000027</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH8</name>
                  <value>0x00000028</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH9</name>
                  <value>0x00000029</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH10</name>
                  <value>0x0000002A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH11</name>
                  <value>0x0000002B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH12</name>
                  <value>0x0000002C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH13</name>
                  <value>0x0000002D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH14</name>
                  <value>0x0000002E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH15</name>
                  <value>0x0000002F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH16</name>
                  <value>0x00000030</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH17</name>
                  <value>0x00000031</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH18</name>
                  <value>0x00000032</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH19</name>
                  <value>0x00000033</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH20</name>
                  <value>0x00000034</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH21</name>
                  <value>0x00000035</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH22</name>
                  <value>0x00000036</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH23</name>
                  <value>0x00000037</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH24</name>
                  <value>0x00000038</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH25</name>
                  <value>0x00000039</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH26</name>
                  <value>0x0000003A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH27</name>
                  <value>0x0000003B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH28</name>
                  <value>0x0000003C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH29</name>
                  <value>0x0000003D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1XCH30</name>
                  <value>0x0000003E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT1YCH31</name>
                  <value>0x0000003F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3XCH0</name>
                  <value>0x00000060</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3YCH1</name>
                  <value>0x00000061</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3XCH2</name>
                  <value>0x00000062</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3YCH3</name>
                  <value>0x00000063</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3XCH4</name>
                  <value>0x00000064</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3YCH5</name>
                  <value>0x00000065</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3XCH6</name>
                  <value>0x00000066</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3YCH7</name>
                  <value>0x00000067</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3XCH8</name>
                  <value>0x00000068</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3YCH9</name>
                  <value>0x00000069</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3XCH10</name>
                  <value>0x0000006A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3YCH11</name>
                  <value>0x0000006B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3XCH12</name>
                  <value>0x0000006C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3YCH13</name>
                  <value>0x0000006D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3XCH14</name>
                  <value>0x0000006E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3YCH15</name>
                  <value>0x0000006F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3XCH16</name>
                  <value>0x00000070</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3YCH17</name>
                  <value>0x00000071</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3XCH18</name>
                  <value>0x00000072</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3YCH19</name>
                  <value>0x00000073</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3XCH20</name>
                  <value>0x00000074</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3YCH21</name>
                  <value>0x00000075</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3XCH22</name>
                  <value>0x00000076</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3YCH23</name>
                  <value>0x00000077</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3XCH24</name>
                  <value>0x00000078</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3YCH25</name>
                  <value>0x00000079</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3XCH26</name>
                  <value>0x0000007A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3YCH27</name>
                  <value>0x0000007B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3XCH28</name>
                  <value>0x0000007C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3YCH29</name>
                  <value>0x0000007D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3XCH30</name>
                  <value>0x0000007E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APORT3YCH31</name>
                  <value>0x0000007F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMBASELINE</name>
          <description>Delta Modulation Baseline</description>
          <addressOffset>0x040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BASELINEUP</name>
              <description>Delta Modulator Integrator Initial Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BASELINEDN</name>
              <description>Delta Modulator Integrator Initial Value</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMCFG</name>
          <description>Delta Modulation Configuration</description>
          <addressOffset>0x044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x103F0FFF</resetMask>
          <fields>
            <field>
              <name>DMG</name>
              <description>Delta Modulator Gain Step</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMR</name>
              <description>Delta Modulator Gain Reduction Interval</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMCR</name>
              <description>Delta Modulator Conversion Rate</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRMODE</name>
              <description>Delta Modulator Conversion Resolution.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DM10</name>
                  <description>10-bit delta modulator</description>
                  <value>0x00000000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DM12</name>
                  <description>12-bit delta modulator</description>
                  <value>0x00000001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DM14</name>
                  <description>14-bit delta modulator</description>
                  <value>0x00000002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DM16</name>
                  <description>16-bit delta modulator</description>
                  <value>0x00000003</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMGRDIS</name>
              <description>Delta Modulation Gain Step Reduction Disable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANACTRL</name>
          <description>Analog Control</description>
          <addressOffset>0x048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000070</resetValue>
          <resetMask>0x00700770</resetMask>
          <fields>
            <field>
              <name>IREFPROG</name>
              <description>Reference Current Control.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDACIREFS</name>
              <description>Current DAC and Reference Current Scale</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRSTPROG</name>
              <description>Reset Timing</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>Interrupt Flag</description>
          <addressOffset>0x054</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>CMP</name>
              <description>Digital Comparator Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CONV</name>
              <description>Conversion Done Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EOS</name>
              <description>End of Scan Interrupt Flag.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DMAOF</name>
              <description>DMA Overflow Interrupt Flag.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APORTCONFLICT</name>
              <description>APORT Conflict Interrupt Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IFS</name>
          <description>Interrupt Flag Set</description>
          <addressOffset>0x058</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>CMP</name>
              <description>Set CMP Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CONV</name>
              <description>Set CONV Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EOS</name>
              <description>Set EOS Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMAOF</name>
              <description>Set DMAOF Interrupt Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APORTCONFLICT</name>
              <description>Set APORTCONFLICT Interrupt Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IFC</name>
          <description>Interrupt Flag Clear</description>
          <addressOffset>0x05C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>CMP</name>
              <description>Clear CMP Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CONV</name>
              <description>Clear CONV Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EOS</name>
              <description>Clear EOS Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DMAOF</name>
              <description>Clear DMAOF Interrupt Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>APORTCONFLICT</name>
              <description>Clear APORTCONFLICT Interrupt Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IEN</name>
          <description>Interrupt Enable</description>
          <addressOffset>0x060</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>CMP</name>
              <description>CMP Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CONV</name>
              <description>CONV Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EOS</name>
              <description>EOS Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAOF</name>
              <description>DMAOF Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APORTCONFLICT</name>
              <description>APORTCONFLICT Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
